////Логотип "Яндекс"
//".//img[@alt='Yandex']"
////Логотип "Самокат"
//".//img[@alt='Scooter']"
////Надпись "Учебный тренажер"
//".//div[@class='Header_Disclaimer__3VEni']"
////Кнопка "Заказать" (вверху)
//".//button[@class='Button_Button__ra12g']"
//        //By orderButtonTop = By.className("Button_Button__ra12g")
////Кнопка "Статус заказа"
//".//button[@class='Header_Link__1TAG7']"
////Надпись "Самокат на прау дней"
//".//div[@class='Home_SecondPart__T0Okx']"
////Текст "Привезём его прямо к вашей двери, а когда накатаетесь — заберём"
//".//div[@style='opacity: 1; display: block;']"
////Рисунок самоката (белый)
//".//div[@style='opacity: 1; transform: translateY(0px);']"
////Текст "Он лёгкий и с мощными колёсами— самое то, чтобы ехать по набережной и нежно барабанить пальцами по рулю"
//".//div[@style='opacity: 1;']"
////Рисунок самоката (черный)
//".//div[@style='opacity: 0; transform: translateY(-35px);']"
////Таблица с характеристиками самоката:
//".//div[@class='Home_Table__2kPxP']"
////Надпись "Как это работает"
//".//div[text()='Как это работает']"
////Блок с описанием стадий заказа:
////    Кружок с цифрой 1
//".//div[text()='1']"
////    Описание первой стадии заказа:
////        Надпись "Заказываете самокат"
//".//div[text()='Заказываете самокат']"
////        Надпись "Выбираете, когда и куда привезти"
//".//div[text()='Выбираете, когда и куда привезти']"
////    Кружок с цифрой 2
//".//div[text()='2']"
////    Описание второй стадии заказа:
////        Надпись "Курьер привозит самокат"
//".//div[text()='Курьер привозит самокат']"
////        Надпись "А вы - оплачиваете аренду"
//".//div[text()='А вы - оплачиваете аренду']"
////    Кружок с цифрой 3
//".//div[text()='3']"
////    Описание третьей стадии заказа:
////        Надпись "Катаетесь"
//".//div[text()='Катаетесь']"
////        Надпись "Сколько часов аренды осталось — видно на сайте"
//".//div[text()='Сколько часов аренды осталось — видно на сайте']"
////    Куружок с цифрой 4
//".//div[text()='4']"
////    Описание четвертой стадии заказа:
////        Надпись "Курьер забирает самокат"
//".//div[text()='Курьер забирает самокат']"
////        Надпись "Когда аренда заканчивается"
//".//div[text()='Когда аренда заканчивается']"
////Кнопка "Заказать" (внизу)
//".//button[@class='Button_Button__ra12g Button_Middle__1CSJM']"
//        // By orderButtonBottom = By.className("Button_Button__ra12g Button_Middle__1CSJM")
////Блок с вопросами о важном
//".//div[@class='Home_FourPart__1uthg']"
////    Надпись "Вопросы о важном"
//".//div[text()='Вопросы о важном']"
////    Список вопросов и ответов
//".//div[@class='Home_FAQ__3uVm4']"
//        // By faqList = By.className("Home_FAQ__3uVm4")
////        Вопрос и ответ №1:
////            Текст вопроса "Сколько это стоит? И как оплатить?"
//".//div[@id='accordion__heading-0']"
//        //By questionOne = By.id("accordion__heading-0")
////            Текст ответа "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
//".//div[@id='accordion__panel-0']"
//       //By answerOne = By.id("accordion__panel-0")
////        Вопрос и ответ №2:
////            Текст вопроса "Хочу сразу несколько самокатов! Так можно?"
//".//div[@id='accordion__heading-1']"
//       //By questionTwo = By.id("accordion__heading-1")
////            Текст ответа "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
//".//div[@id='accordion__panel-1']"
//        // By answerTwo = By.id("accordion__panel-1")
////        Вопрос и ответ №3:
////            Текст вопроса "Как рассчитывается время аренды?"
//".//div[@id='accordion__heading-2']"
//         //By questionThree = By.id("accordion__heading-2")
////            Текст ответа "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
//".//div[@id='accordion__panel-2']"
//       //  By answerThree = By.id("accordion__panel-2")
////        Вопрос и ответ №4:
////            Текст вопроса "Можно ли заказать самокат прямо на сегодня?"
//".//div[@id='accordion__heading-3']"
//       // By questionFour = By.id("accordion__heading-3")
////            Текст ответа "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
//".//div[@id='accordion__panel-3']"
//      //  By answerFour = By.id("accordion__panel-3")
////        Вопрос и ответ №5:
////            Текст вопроса "Можно ли продлить заказ или вернуть самокат раньше?"
//".//div[@id='accordion__heading-4']"
//         //By questionFive = By.id("accordion__heading-4")
////            Текст ответа "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010"
//".//div[@id='accordion__panel-4']"
//       //  By answerFive = By.id("accordion__panel-4")
////        Вопрос и ответ №6:
////            Текст вопроса "Вы привозите зарядку вместе с самокатом?"
//".//div[@id='accordion__heading-5']"
//      //   By questionSix = By.id("accordion__heading-5")
////            Текст ответа "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
//".//div[@id='accordion__panel-5']"
//      //  By answerSix = By.id("accordion__panel-5")
////        Вопрос и ответ №7:
////            Текст вопроса "Можно ли отменить заказ?"
//".//div[@id='accordion__heading-6']"
//       //  By questionSeven = By.id("accordion__heading-6")
////            Текст ответа "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
//".//div[@id='accordion__panel-6']"
//        /// By answerSeven = By.id("accordion__panel-6")
////        Вопрос и ответ №8:
////            Текст вопроса "Я живу за МКАДом, привезёте?"
//".//div[@id='accordion__heading-7']"
//      // By questionEight = By.id("accordion__heading-7")
////            Текст ответа "Да, обязательно. Всем самокатов! И Москве, и Московской области."
//".//div[@id='accordion__panel-7']"
//      // By answerEight = By.id("accordion__panel-7")
////
////
////
////
